contiki-os/contiki/cc26xxware/inc/hw_aux_evctl.h
// Field: [4]    AUXIO7
//
// Current value of AUXIO7 input data line
#define AUX_EVCTL_EVSTAT1_AUXIO7                                    0x00000010
#define AUX_EVCTL_EVSTAT1_AUXIO7_BITN                               4
#define AUX_EVCTL_EVSTAT1_AUXIO7_M                                  0x00000010
#define AUX_EVCTL_EVSTAT1_AUXIO7_S                                  4

// Field: [3]    AUXIO6
//
// Current value of AUXIO6 input data line
#define AUX_EVCTL_EVSTAT1_AUXIO6                                    0x00000008
#define AUX_EVCTL_EVSTAT1_AUXIO6_BITN                               3
#define AUX_EVCTL_EVSTAT1_AUXIO6_M                                  0x00000008
#define AUX_EVCTL_EVSTAT1_AUXIO6_S                                  3

// Field: [2]    AUXIO5
//
// Current value of AUXIO5 input data line
#define AUX_EVCTL_EVSTAT1_AUXIO5                                    0x00000004
#define AUX_EVCTL_EVSTAT1_AUXIO5_BITN                               2
#define AUX_EVCTL_EVSTAT1_AUXIO5_M                                  0x00000004
#define AUX_EVCTL_EVSTAT1_AUXIO5_S                                  2

// Field: [1]    AUXIO4
//
// Current value of AUXIO4 input data line
#define AUX_EVCTL_EVSTAT1_AUXIO4                                    0x00000002
#define AUX_EVCTL_EVSTAT1_AUXIO4_BITN                               1
#define AUX_EVCTL_EVSTAT1_AUXIO4_M                                  0x00000002
#define AUX_EVCTL_EVSTAT1_AUXIO4_S                                  1

// Field: [0]    AUXIO3
//
// Current value of AUXIO3 input data line
#define AUX_EVCTL_EVSTAT1_AUXIO3                                    0x00000001
#define AUX_EVCTL_EVSTAT1_AUXIO3_BITN                               0
#define AUX_EVCTL_EVSTAT1_AUXIO3_M                                  0x00000001
#define AUX_EVCTL_EVSTAT1_AUXIO3_S                                  0

//*****************************************************************************
//
// Register: AUX_EVCTL_O_EVTOMCUPOL
//
//*****************************************************************************
// Field: [10]    ADC_IRQ
//
// Selects the event source level that sets EVTOMCUFLAGS.ADC_IRQ.
// ENUMs:
// HIGH                 High level
// LOW                  Low level
//
#define AUX_EVCTL_EVTOMCUPOL_ADC_IRQ                                0x00000400
#define AUX_EVCTL_EVTOMCUPOL_ADC_IRQ_BITN                           10
#define AUX_EVCTL_EVTOMCUPOL_ADC_IRQ_M                              0x00000400
#define AUX_EVCTL_EVTOMCUPOL_ADC_IRQ_S                              10
#define AUX_EVCTL_EVTOMCUPOL_ADC_IRQ_HIGH                           0x00000000
#define AUX_EVCTL_EVTOMCUPOL_ADC_IRQ_LOW                            0x00000400

// Field: [9]    OBSMUX0
//
// Selects the event source level that sets EVTOMCUFLAGS.OBSMUX0.
// ENUMs:
// HIGH                 High level
// LOW                  Low level
//
#define AUX_EVCTL_EVTOMCUPOL_OBSMUX0                                0x00000200
#define AUX_EVCTL_EVTOMCUPOL_OBSMUX0_BITN                           9
#define AUX_EVCTL_EVTOMCUPOL_OBSMUX0_M                              0x00000200
#define AUX_EVCTL_EVTOMCUPOL_OBSMUX0_S                              9
#define AUX_EVCTL_EVTOMCUPOL_OBSMUX0_HIGH                           0x00000000
#define AUX_EVCTL_EVTOMCUPOL_OBSMUX0_LOW                            0x00000200

// Field: [8]    ADC_FIFO_ALMOST_FULL
//
// Selects the event source level that sets EVTOMCUFLAGS.ADC_FIFO_ALMOST_FULL.
// ENUMs:
// HIGH                 High level
// LOW                  Low level
//
#define AUX_EVCTL_EVTOMCUPOL_ADC_FIFO_ALMOST_FULL                   0x00000100
#define AUX_EVCTL_EVTOMCUPOL_ADC_FIFO_ALMOST_FULL_BITN              8
#define AUX_EVCTL_EVTOMCUPOL_ADC_FIFO_ALMOST_FULL_M                 0x00000100
#define AUX_EVCTL_EVTOMCUPOL_ADC_FIFO_ALMOST_FULL_S                 8
#define AUX_EVCTL_EVTOMCUPOL_ADC_FIFO_ALMOST_FULL_HIGH              0x00000000
#define AUX_EVCTL_EVTOMCUPOL_ADC_FIFO_ALMOST_FULL_LOW               0x00000100

// Field: [7]    ADC_DONE
//
// Selects the event source level that sets EVTOMCUFLAGS.ADC_DONE.
// ENUMs:
// HIGH                 High level
// LOW                  Low level
//
#define AUX_EVCTL_EVTOMCUPOL_ADC_DONE                               0x00000080
#define AUX_EVCTL_EVTOMCUPOL_ADC_DONE_BITN                          7
#define AUX_EVCTL_EVTOMCUPOL_ADC_DONE_M                             0x00000080
#define AUX_EVCTL_EVTOMCUPOL_ADC_DONE_S                             7
#define AUX_EVCTL_EVTOMCUPOL_ADC_DONE_HIGH                          0x00000000
#define AUX_EVCTL_EVTOMCUPOL_ADC_DONE_LOW                           0x00000080

// Field: [6]    SMPH_AUTOTAKE_DONE
//
// Selects the event source level that sets EVTOMCUFLAGS.SMPH_AUTOTAKE_DONE.
// ENUMs:
// HIGH                 High level
// LOW                  Low level
//
#define AUX_EVCTL_EVTOMCUPOL_SMPH_AUTOTAKE_DONE                     0x00000040
#define AUX_EVCTL_EVTOMCUPOL_SMPH_AUTOTAKE_DONE_BITN                6
#define AUX_EVCTL_EVTOMCUPOL_SMPH_AUTOTAKE_DONE_M                   0x00000040
#define AUX_EVCTL_EVTOMCUPOL_SMPH_AUTOTAKE_DONE_S                   6
#define AUX_EVCTL_EVTOMCUPOL_SMPH_AUTOTAKE_DONE_HIGH                0x00000000
#define AUX_EVCTL_EVTOMCUPOL_SMPH_AUTOTAKE_DONE_LOW                 0x00000040

// Field: [5]    TIMER1_EV
//
// Selects the event source level that sets EVTOMCUFLAGS.TIMER1_EV.
// ENUMs:
// HIGH                 High level
// LOW                  Low level
//
#define AUX_EVCTL_EVTOMCUPOL_TIMER1_EV                              0x00000020
#define AUX_EVCTL_EVTOMCUPOL_TIMER1_EV_BITN                         5
#define AUX_EVCTL_EVTOMCUPOL_TIMER1_EV_M                            0x00000020
#define AUX_EVCTL_EVTOMCUPOL_TIMER1_EV_S                            5
#define AUX_EVCTL_EVTOMCUPOL_TIMER1_EV_HIGH                         0x00000000
#define AUX_EVCTL_EVTOMCUPOL_TIMER1_EV_LOW                          0x00000020

// Field: [4]    TIMER0_EV
//
// Selects the event source level that sets EVTOMCUFLAGS.TIMER0_EV.
// ENUMs:
// HIGH                 High level
// LOW                  Low level
//
#define AUX_EVCTL_EVTOMCUPOL_TIMER0_EV                              0x00000010
#define AUX_EVCTL_EVTOMCUPOL_TIMER0_EV_BITN                         4
#define AUX_EVCTL_EVTOMCUPOL_TIMER0_EV_M                            0x00000010
#define AUX_EVCTL_EVTOMCUPOL_TIMER0_EV_S                            4
#define AUX_EVCTL_EVTOMCUPOL_TIMER0_EV_HIGH                         0x00000000
#define AUX_EVCTL_EVTOMCUPOL_TIMER0_EV_LOW                          0x00000010

